todo.tex
% Created 2020-02-03 lun 16:57
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Andrea Mascaretti}
\date{\today}
\title{Moxier}
\hypersetup{
 pdfauthor={Andrea Mascaretti},
 pdftitle={Moxier},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.3 (Org mode 9.1.9)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents



\section{MOXIER}
\label{sec:org39356a6}
\subsection{{\bfseries\sffamily TODO} Porting to package [3/21]}
\label{sec:org25d3549}
\subsubsection{{\bfseries\sffamily DONE} 00-introduction-installing-r}
\label{sec:org7162643}
\subsubsection{{\bfseries\sffamily DONE} 01-introduction-programming-r}
\label{sec:org0452c3c}
\subsubsection{{\bfseries\sffamily DONE} 02-data-visualisations-graphics}
\label{sec:orga7e6b05}
\subsubsection{{\bfseries\sffamily TODO} 03-data-visualisations-ggplot2}
\label{sec:org593cde6}
\begin{enumerate}
\item \texttt{ggplot2}
\label{sec:org34a42a1}
\begin{itemize}
\item \texttt{ggplot2} not found.
\item check the \texttt{DESCRIPTION} file to check if the package is loaded. It is included!
\item I wasn't loading the \texttt{ggplot2} and \texttt{dplyr} libraries. I also added \texttt{dplyr} to the required packages.
\end{itemize}
\end{enumerate}
\subsubsection{{\bfseries\sffamily TODO} 04-descriptive-statistics-univariate}
\label{sec:org5a62835}
\begin{enumerate}
\item Issues
\label{sec:orge8dacbb}
\begin{itemize}
\item Missing \texttt{moments}, \texttt{plotrix}.
\item Data: I must move \textbf{magnesium} into the package.
\end{itemize}
\end{enumerate}
\subsubsection{{\bfseries\sffamily TODO} 05-descriptive-statistics-depth-measures}
\label{sec:org93dfd4b}
\subsubsection{{\bfseries\sffamily TODO} 06-descriptive-statistics-multivariate}
\label{sec:org963f000}
\subsubsection{{\bfseries\sffamily TODO} 07-descriptive-statistics-curse-dimensionality}
\label{sec:org6cab4b4}
\subsubsection{{\bfseries\sffamily TODO} 08-dimensionality-reduction-pca}
\label{sec:org608c85e}
\subsubsection{{\bfseries\sffamily TODO} 09-dimensionality-reduction-pca}
\label{sec:orgab5c89c}
\subsubsection{{\bfseries\sffamily TODO} 10-dimensionality-reduction-pca}
\label{sec:orgccbc758}
\subsubsection{{\bfseries\sffamily TODO} 11-hypotheses-test-anova}
\label{sec:org232d5e3}
\subsubsection{{\bfseries\sffamily TODO} 12-hypotheses-test-anova}
\label{sec:orgeb7ccce}
\subsubsection{{\bfseries\sffamily TODO} 13-linear-regression}
\label{sec:orgc352494}
\subsubsection{{\bfseries\sffamily TODO} 14-linear-regression}
\label{sec:orgabffd67}
\subsubsection{{\bfseries\sffamily TODO} 15-classification}
\label{sec:org66d39b8}
\subsubsection{{\bfseries\sffamily TODO} 16-classification}
\label{sec:org13431f1}
\subsubsection{{\bfseries\sffamily TODO} 17-clustering}
\label{sec:org69e1cc0}
\subsubsection{{\bfseries\sffamily TODO} 18-clustering}
\label{sec:org96a45a8}
\subsubsection{{\bfseries\sffamily TODO} 19-clustering}
\label{sec:org9906da2}
\subsubsection{{\bfseries\sffamily TODO} 20-extra-introduction-dplyr}
\label{sec:orga0ab39c}
\subsection{{\bfseries\sffamily TODO} Website [0\%]}
\label{sec:org39cf8b6}
\subsubsection{{\bfseries\sffamily TODO} Read \href{https://pkgdown.r-lib.org/}{pkgdown} documentation}
\label{sec:org80e55e2}
\subsection{External Data in Packages}
\label{sec:org7002848}
I now follow \href{https://r-pkgs.org/data.html}{this book} to get my head around the correct way to include data into an \texttt{R} package.
\begin{itemize}
\item The directory where to put it is \texttt{/data}
\item The file should be a \texttt{.RData} file
\item It is achieved using \texttt{usethis::use\_data()}
\item Raw files should be included within the \texttt{data-raw} directory.
\item Data should be documented. It is not dissimilar from documenting
functions. Documentations is stored in the \texttt{R} folder.
\end{itemize}
\end{document}
